RT-Thread/rt-thread/bsp/maxim/libraries/MAX32660PeriphDriver/CMSIS/Device/Maxim/MAX32660/Include/max32660.svd
   </registers>
  </peripheral>
<!--FLC Flash Memory Control.-->
  <peripheral>
   <name>GCR</name>
   <description>Global Control Registers.</description>
   <baseAddress>0x40000000</baseAddress>
   <addressBlock>
    <offset>0</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>SCON</name>
     <description>System Control.</description>
     <addressOffset>0x00</addressOffset>
     <resetMask>0xFFFFFFFE</resetMask>
     <fields>
      <field>
       <name>SBUSARB</name>
       <description>System bus abritration scheme. These bits are used to select between Fixed-burst abritration and Round-Robin scheme. The Round-Robin scheme is selected by default. These bits are reset by the system reset.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>fix</name>
         <description>Fixed Burst abritration.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>round</name>
         <description>Round-robin scheme.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FLASH_PAGE_FLIP</name>
       <description>Flips the Flash bottom and top halves. (Depending on the total flash size, each half is either 256K or 512K). Initiating a flash page flip will cause a flush of both the data buffer on the DCODE bus and the internal instruction buffer.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Physical layout matches logical layout.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>swapped</name>
         <description>Bottom half mapped to logical top half and vice versa.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FPU_DIS</name>
       <description>Floating Point Unit Disable </description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>enable</name>
         <description>enable Floating point unit</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>disable</name>
         <description>disable floating point unit </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CCACHE_FLUSH</name>
       <description>Code Cache Flush. This bit is used to flush the code caches and the instruction buffer of the Cortex-M4. </description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Code Cache Operation</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>flush</name>
         <description>Code Caches and CPU instruction buffer are flushed </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SWD_DIS</name>
       <description>Serial Wire Debug Disable </description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>enable</name>
         <description>Enable JTAG SWD</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>disable</name>
         <description>Disable JTAG SWD </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>RSTR0</name>
     <description>Reset.</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>DMA</name>
       <description>DMA Reset.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>dma_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>dma_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>WDT</name>
       <description>Watchdog Timer Reset.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>wdt_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>wdt_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>GPIO0</name>
       <description>GPIO0 Reset. Setting this bit to 1 resets GPIO0 pins to their default states.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>gpio0_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>gpio0_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TIMER0</name>
       <description>Timer0 Reset. Setting this bit to 1 resets Timer 0 blocks.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>timer0_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>timer0_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TIMER1</name>
       <description>Timer1 Reset. Setting this bit to 1 resets Timer 1 blocks.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>timer1_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>timer1_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TIMER2</name>
       <description>Timer2 Reset. Setting this bit to 1 resets Timer 2 blocks.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>timer2_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>timer2_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>UART0</name>
       <description>UART0 Reset. Setting this bit to 1 resets all UART 0 blocks.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>uart0_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>uart0_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>UART1</name>
       <description>UART1 Reset. Setting this bit to 1 resets all UART 1 blocks.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>uart1_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>uart1_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SPI0</name>
       <description>SPI0 Reset. Setting this bit to 1 resets all SPI 0 blocks.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>spi0_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>spi0_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SPI1</name>
       <description>SPI1 Reset. Setting this bit to 1 resets all SPI 1 blocks.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>spi1_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>xpi1_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C0</name>
       <description>I2C0 Reset.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>i2c0_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>i2c0_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RTC</name>
       <description>Real Time Clock Reset.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>rtc_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>rtc_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SRST</name>
       <description>Soft Reset.Write 1 to perform a Soft Reset. A soft reset performs a Peripheral Reset and also resets the GPIO peripheral but does not reset the CPU or Watchdog Timer.</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>srst_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>srst_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PRST</name>
       <description>Peripheral Reset. Setting this bit to 1 resets all peripherals. The CPU core, the watchdog timer, and all GPIO pins are unaffected by this reset.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>prst_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>prst_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SYSTEM</name>
       <description>System Reset. Setting this bit to 1 resets the CPU core and all peripherals, including the watchdog timer.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>system_write</name>
        <usage>write</usage>
        <enumeratedValue>
         <name>RFU</name>
         <description>Reserved. Do not use.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
       <enumeratedValues>
        <name>system_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>Reset_Done</name>
         <description>Reset Complete</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>Reset Busy</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
