RT-Thread/rt-thread/bsp/maxim/libraries/MAX32660PeriphDriver/CMSIS/Device/Maxim/MAX32660/Include/max32660.svd
    <register>
     <name>INT_EN0</name>
     <description>Interrupt Enable Register.</description>
     <addressOffset>0x0C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>DONE</name>
       <description>Transfer Done Interrupt Enable.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled when DONE = 1.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_MODE</name>
       <description>Description not available.</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled when RX_MODE = 1.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>GEN_CTRL_ADDR</name>
       <description>Slave mode general call address match received input enable.</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled when GEN_CTRL_ADDR = 1.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADDR_MATCH</name>
       <description>Slave mode incoming address match interrupt.</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled when ADDR_MATCH = 1.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_THRESH</name>
       <description>RX FIFO Above Treshold Level Interrupt Enable.</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_THRESH</name>
       <description>TX FIFO Below Treshold Level Interrupt Enable.</description>
       <bitRange>[5:5]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>STOP</name>
       <description>Stop Interrupt Enable</description>
       <bitRange>[6:6]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled when STOP = 1.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADDR_ACK</name>
       <description>Received Address ACK from Slave Interrupt.</description>
       <bitRange>[7:7]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ARB_ER</name>
       <description>Master Mode Arbitration Lost Interrupt.</description>
       <bitRange>[8:8]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TO_ER</name>
       <description>Timeout Error Interrupt Enable.</description>
       <bitRange>[9:9]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADDR_ER</name>
       <description>Master Mode Address NACK Received Interrupt.</description>
       <bitRange>[10:10]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DATA_ER</name>
       <description>Master Mode Data NACK Received Interrupt.</description>
       <bitRange>[11:11]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DO_NOT_RESP_ER</name>
       <description>Slave Mode Do Not Respond Interrupt.</description>
       <bitRange>[12:12]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>START_ER</name>
       <description>Out of Sequence START condition detected interrupt.</description>
       <bitRange>[13:13]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>STOP_ER</name>
       <description>Out of Sequence STOP condition detected interrupt.</description>
       <bitRange>[14:14]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_LOCK_OUT</name>
       <description>TX FIFO Locked Out Interrupt.</description>
       <bitRange>[15:15]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Interrupt disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Interrupt enabled when TXLOIE = 1.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INT_FL1</name>
     <description>Interrupt Status Register 1.</description>
     <addressOffset>0x10</addressOffset>
     <fields>
      <field>
       <name>RX_OVERFLOW</name>
       <description>Receiver Overflow Interrupt. When operating as a slave receiver, this bit is set when you reach the first data bit and the RX FIFO and shift register are both full.</description>
       <bitRange>[0:0]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_UNDERFLOW</name>
       <description>Transmit Underflow Interrupt. When operating as a slave transmitter, this bit is set when you reach the first data bit and the TX FIFO is empty and the master is still asking for more data (i.e the master hasn't sent a NACK yet).</description>
       <bitRange>[1:1]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INT_EN1</name>
     <description>Interrupt Staus Register 1.</description>
     <addressOffset>0x14</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>RX_OVERFLOW</name>
       <description>Receiver Overflow Interrupt Enable.</description>
       <bitRange>[0:0]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_UNDERFLOW</name>
       <description>Transmit Underflow Interrupt Enable.</description>
       <bitRange>[1:1]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO_LEN</name>
     <description>FIFO Configuration Register.</description>
     <addressOffset>0x18</addressOffset>
     <fields>
      <field>
       <name>RX_LEN</name>
       <description>Receive FIFO Length.</description>
       <bitRange>[7:0]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>TX_LEN</name>
       <description>Transmit FIFO Length.</description>
       <bitRange>[15:8]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RX_CTRL0</name>
     <description>Receive Control Register 0.</description>
     <addressOffset>0x1C</addressOffset>
     <fields>
      <field>
       <name>DNR</name>
       <description>Do Not Respond.</description>
       <bitRange>[0:0]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>respond</name>
         <description>Always respond to address match.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>not_respond_rx_fifo_empty</name>
         <description>Do not respond to address match when RX_FIFO is not empty.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_FLUSH</name>
       <description>Receive FIFO Flush. This bit is automatically cleared to 0 after the operation. Setting this bit to 1 will affect RX_FIFO status.</description>
       <bitRange>[7:7]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>not_flushed</name>
         <description>FIFO not flushed.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>flush</name>
         <description>Flush RX_FIFO.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_THRESH</name>
       <description>Receive FIFO Threshold. These bits define the RX_FIFO interrupt threshold.</description>
       <bitRange>[11:8]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>RX_CTRL1</name>
     <description>Receive Control Register 1.</description>
     <addressOffset>0x20</addressOffset>
     <fields>
      <field>
       <name>RX_CNT</name>
       <description>Receive Count Bits. These bits define the number of bytes to be received in a transaction, except for the case RXCNT = 0. RXCNT = 0 means 256 bytes to be received in a transaction.</description>
       <bitRange>[7:0]</bitRange>
      </field>
      <field>
       <name>RX_FIFO</name>
       <description>Receive FIFO Count. These bits reflect the number of byte in the RX_FIFO. These bits are flushed when I2CEN = 0.</description>
       <bitRange>[11:8]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TX_CTRL0</name>
     <description>Transmit Control Register 0.</description>
     <addressOffset>0x24</addressOffset>
     <fields>
      <field>
       <name>TX_PRELOAD</name>
       <description>Transmit FIFO Preaload Mode. Setting this bit will allow for high speed application to preload the transmit FIFO prior to Slave Address Match.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>TX_READY_MODE</name>
       <description>Transmit FIFO Ready Manual Mode.</description>
       <bitRange>[1:1]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>HW control of I2CTXRDY enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>HW control of I2CTXRDY disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_FLUSH</name>
       <description>Transmit FIFO Flush. This bit is automatically cleared to 0 after the operation.</description>
       <bitRange>[7:7]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>not_flushed</name>
         <description>FIFO not flushed.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>flush</name>
         <description>Flush TX_FIFO.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_THRESH</name>
       <description>Transmit FIFO Threshold. These bits define the TX_FIFO interrupt threshold.</description>
       <bitRange>[11:8]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TX_CTRL1</name>
     <description>Transmit Control Register 1.</description>
     <addressOffset>0x28</addressOffset>
     <fields>
      <field>
       <name>TX_READY</name>
       <description>Transmit FIFO Preload Ready.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>TX_LAST</name>
       <description>Transmit Last. This bit is used in slave mod only. Do not use when preloading (cleared by hardware).</description>
       <bitRange>[1:1]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>hold_scl_low</name>
         <description>Hold SCL low on TX_FIFO empty.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>end_transaction</name>
         <description>End transaction on TX_FIFO empty.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_FIFO</name>
       <description>Transmit FIFO Count. These bits reflect the number of bytes in the TX_FIFO.</description>
       <bitRange>[11:8]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO</name>
     <description>Data Register.</description>
     <addressOffset>0x2C</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data is read from or written to this location. Transmit and receive FIFO are separate but both are addressed at this location.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MASTER_CTRL</name>
     <description>Master Control Register.</description>
     <addressOffset>0x30</addressOffset>
     <fields>
      <field>
       <name>START</name>
       <description>Setting this bit to 1 will start a master transfer.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>RESTART</name>
       <description>Setting this bit to 1 will generate a repeated START.</description>
       <bitRange>[1:1]</bitRange>
      </field>
      <field>
       <name>STOP</name>
       <description>Setting this bit to 1 will generate a STOP condition.</description>
       <bitRange>[2:2]</bitRange>
      </field>
      <field>
       <name>SL_EX_ADDR</name>
       <description>Slave Extend Address Select.</description>
       <bitRange>[7:7]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>7_bits_address</name>
         <description>7-bit address.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>10_bits_address</name>
         <description>10-bit address.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MASTER_CODE</name>
       <description>Master Code. These bits set the Master Code used in Hs-mode operation.</description>
       <bitRange>[10:8]</bitRange>
      </field>
      <field>
       <name>SCL_SPEED_UP</name>
       <description>Serial Clock speed Up. Setting this bit disables the master's monitoring of SCL state for other external masters or slaves.</description>
       <bitRange>[11:11]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Master monitors SCL state.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>SCL state monitoring disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>CLK_LO</name>
     <description>Clock Low Register.</description>
     <addressOffset>0x34</addressOffset>
     <fields>
      <field>
       <name>CLK_LO</name>
       <description>Clock low. In master mode, these bits define the SCL low period. In slave mode, these bits define the time SCL will be held low after data is outputted.</description>
       <bitRange>[8:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CLK_HI</name>
     <description>Clock high Register.</description>
     <addressOffset>0x38</addressOffset>
     <fields>
      <field>
       <name>CKH</name>
       <description>Clock High. In master mode, these bits define the SCL high period.</description>
       <bitRange>[8:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>HS_CLK</name>
     <description>HS-Mode Clock Control Register</description>
     <addressOffset>0x3C</addressOffset>
     <fields>
      <field>
       <name>HS_CLK_LO</name>
       <description>Slave Address.</description>
       <bitRange>[7:0]</bitRange>
      </field>
      <field>
       <name>HS_CLK_HI</name>
       <description>Slave Address.</description>
       <bitRange>[15:8]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TIMEOUT</name>
     <description>Timeout Register</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>TO</name>
       <description>Timeout</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>SLAVE_ADDR</name>
     <description>Slave Address Register.</description>
     <addressOffset>0x44</addressOffset>
     <fields>
      <field>
       <name>SLAVE_ADDR</name>
       <description>Slave Address.</description>
       <bitRange>[9:0]</bitRange>
      </field>
      <field>
       <name>SLAVE_ADDR_DIS</name>
       <description>Slave Address DIS.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>SLAVE_ADDR_IDX</name>
       <description>Slave Address Index.</description>
       <bitRange>[14:11]</bitRange>
      </field>
      <field>
       <name>EX_ADDR</name>
       <description>Extended Address Select.</description>
       <bitRange>[15:15]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>7_bits_address</name>
         <description>7-bit address.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>10_bits_address</name>
         <description>10-bit address.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
